[
  {
    "id": "EVI001",
    "type": "TrialSummary",
    "title": "Phase III Study of Osimertinib in EGFR T790M-Positive Advanced NSCLC (AURA3)",
    "publicationDate": "2017-01-19",
    "doi": "10.1056/NEJMoa1612674",
    "sourceUrl": "https://www.nejm.org/doi/full/10.1056/NEJMoa1612674",
    "authorsOrOrg": "Mok TS, Wu YL, Ahn MJ, Garassino MC, et al.",
    "venue": "New England Journal of Medicine",
    "trialId": "NCT02151981",
    "abstractText": "Osimertinib is an oral, third-generation, irreversible EGFR tyrosine kinase inhibitor (TKI) that is selective for both EGFR-TKI–sensitizing and EGFR T790M resistance mutations. We conducted a phase 3 trial comparing osimertinib with platinum therapy plus pemetrexed in patients with T790M-positive advanced non–small-cell lung cancer (NSCLC) whose disease had progressed during first-line EGFR-TKI therapy.",
    "methodsText": "Open-label, randomized (2:1). Patients: T790M-positive advanced NSCLC post-EGFR TKI. Primary endpoint: PFS.",
    "peerReviewed": "true",
    "confidence": "High",
    "limitations": "Open-label design; T790M-specific population",
    "funding": "AstraZeneca",
    "conflictOfInterest": "true"
  },
  {
    "id": "EVI002",
    "type": "Paper",
    "title": "First-Line Osimertinib in EGFR Mutation-Positive NSCLC (FLAURA)",
    "publicationDate": "2018-01-11",
    "doi": "10.1056/NEJMoa1713137",
    "sourceUrl": "https://www.nejm.org/doi/full/10.1056/NEJMoa1713137",
    "authorsOrOrg": "Soria JC, Ohe Y, Vansteenkiste J, et al.",
    "venue": "New England Journal of Medicine",
    "trialId": "NCT02296125",
    "abstractText": "Osimertinib is an oral, third-generation, irreversible EGFR tyrosine kinase inhibitor that selectively targets both sensitizing and T790M resistance EGFR mutations. We conducted an international, double-blind, randomized, phase 3 trial of osimertinib versus standard EGFR-TKI therapy (gefitinib or erlotinib) in previously untreated patients with EGFR mutation-positive advanced non–small-cell lung cancer.",
    "methodsText": "Double-blind, randomized (1:1). Treatment-naive EGFR-mutant NSCLC (ex19del or L858R). Primary endpoint: PFS by investigator assessment.",
    "peerReviewed": "true",
    "confidence": "High",
    "limitations": null,
    "funding": "AstraZeneca",
    "conflictOfInterest": "true"
  },
  {
    "id": "EVI003",
    "type": "TrialSummary",
    "title": "Alectinib versus Crizotinib in Treatment-Naive ALK-Positive NSCLC (ALEX)",
    "publicationDate": "2017-06-06",
    "doi": "10.1056/NEJMoa1704795",
    "sourceUrl": "https://www.nejm.org/doi/full/10.1056/NEJMoa1704795",
    "authorsOrOrg": "Peters S, Camidge DR, Shaw AT, et al.",
    "venue": "New England Journal of Medicine",
    "trialId": "NCT02075840",
    "abstractText": "Crizotinib is the standard first-line treatment for ALK-positive advanced non–small-cell lung cancer (NSCLC). Alectinib is a highly selective ALK inhibitor with demonstrated efficacy in crizotinib-treated patients. We compared alectinib with crizotinib in patients with previously untreated, ALK-positive, advanced NSCLC.",
    "methodsText": "Open-label, randomized (1:1). Treatment-naive ALK-positive advanced NSCLC. Primary endpoint: investigator-assessed PFS.",
    "peerReviewed": "true",
    "confidence": "High",
    "limitations": "Open-label; limited OS data at initial analysis",
    "funding": "F. Hoffmann-La Roche",
    "conflictOfInterest": "true"
  },
  {
    "id": "EVI004",
    "type": "Paper",
    "title": "Lorlatinib in ALK-Positive Lung Cancer with Brain Metastases",
    "publicationDate": "2018-12-18",
    "doi": "10.1056/NEJMoa1808913",
    "sourceUrl": "https://www.nejm.org/doi/full/10.1056/NEJMoa1808913",
    "authorsOrOrg": "Solomon BJ, Besse B, Bauer TM, et al.",
    "venue": "New England Journal of Medicine",
    "trialId": "NCT01970865",
    "abstractText": "Lorlatinib, a third-generation ALK tyrosine kinase inhibitor, has shown promising activity in patients with ALK-positive lung cancer that progressed after treatment with earlier-generation ALK inhibitors. We conducted a phase 2 trial of lorlatinib in patients with ALK-positive NSCLC who had received previous treatment, including earlier-generation ALK inhibitors.",
    "methodsText": "Single-arm, phase 2 trial. Patients with ALK-positive NSCLC, prior ALK inhibitor treatment. Multiple expansion cohorts including patients with brain metastases.",
    "peerReviewed": "true",
    "confidence": "High",
    "limitations": "Single-arm design; phase 2 (not phase 3)",
    "funding": "Pfizer",
    "conflictOfInterest": "true"
  },
  {
    "id": "EVI005",
    "type": "Paper",
    "title": "Afatinib versus Gefitinib as First-Line Treatment for EGFR Mutation-Positive NSCLC (LUX-Lung 7)",
    "publicationDate": "2016-05-04",
    "doi": "10.1016/S1470-2045(16)30033-X",
    "sourceUrl": "https://www.thelancet.com/journals/lanonc/article/PIIS1470-2045(16)30033-X/fulltext",
    "authorsOrOrg": "Park K, Tan EH, O'Byrne K, et al.",
    "venue": "The Lancet Oncology",
    "trialId": "NCT01466660",
    "abstractText": "Afatinib and gefitinib are oral irreversible and reversible ErbB family blockers, respectively, both approved as first-line treatments for patients with EGFR mutation-positive non-small-cell lung cancer. We aimed to compare the efficacy and safety of afatinib with gefitinib in this patient population.",
    "methodsText": "Open-label, randomized phase 2b trial (1:1). Treatment-naive EGFR mutation-positive (Del19 or L858R) NSCLC. Primary endpoint: PFS by independent review.",
    "peerReviewed": "true",
    "confidence": "Medium",
    "limitations": "Phase 2b (smaller sample size); open-label",
    "funding": "Boehringer Ingelheim",
    "conflictOfInterest": "true"
  },
  {
    "id": "EVI006",
    "type": "Review",
    "title": "Targeting EGFR in Lung Cancer: Current Standards and Development of Next-Generation Therapies",
    "publicationDate": "2020-07-15",
    "doi": "10.1634/theoncologist.2020-0154",
    "sourceUrl": "https://academic.oup.com/oncolo/article/25/7/590/6405819",
    "authorsOrOrg": "Passaro A, Jänne PA, Mok T, Peters S",
    "venue": "The Oncologist",
    "trialId": null,
    "abstractText": "Epidermal growth factor receptor (EGFR) mutations are found in approximately 10%–15% of non-small cell lung cancers (NSCLCs) in Western countries and in 30%–50% in Asian populations. EGFR tyrosine kinase inhibitors (TKIs) have revolutionized the treatment landscape for EGFR mutation-positive NSCLC. This review summarizes current standards of care and emerging therapies.",
    "methodsText": "Systematic review of clinical trials and real-world evidence. Focus on EGFR-mutant NSCLC treatment strategies.",
    "peerReviewed": "true",
    "confidence": "High",
    "limitations": "Review article; not primary research",
    "funding": "None declared",
    "conflictOfInterest": "false"
  },
  {
    "id": "EVI007",
    "type": "Preprint",
    "title": "Real-World Outcomes of Fourth-Generation EGFR Inhibitors in T790M-Negative Resistance",
    "publicationDate": "2025-11-20",
    "doi": null,
    "sourceUrl": "https://www.medrxiv.org/content/10.1101/2025.11.20.12345678v1",
    "authorsOrOrg": "Kim J, Lee S, Park M, et al.",
    "venue": "medRxiv (preprint)",
    "trialId": null,
    "abstractText": "Background: Mechanisms of EGFR-TKI resistance beyond T790M are increasingly recognized. This real-world study evaluates outcomes of novel fourth-generation EGFR inhibitors in patients with T790M-negative resistance patterns. Methods: Retrospective analysis of 127 patients treated at three academic centers. Results: ORR 34%, median PFS 7.2 months.",
    "methodsText": "Retrospective, multi-center. T790M-negative post-EGFR TKI patients. Novel fourth-gen inhibitor.",
    "peerReviewed": "false",
    "confidence": "Low",
    "limitations": "Preprint (not peer-reviewed); retrospective; small N",
    "funding": "Institutional",
    "conflictOfInterest": "unknown"
  },
  {
    "id": "EVI008",
    "type": "TrialSummary",
    "title": "Brigatinib versus Alectinib in Treatment-Naive ALK-Positive NSCLC (ALTA-1L)",
    "publicationDate": "2020-09-25",
    "doi": "10.1016/j.jtho.2020.06.028",
    "sourceUrl": "https://www.jto.org/article/S1556-0864(20)30551-6/fulltext",
    "authorsOrOrg": "Camidge DR, Kim HR, Ahn MJ, et al.",
    "venue": "Journal of Thoracic Oncology",
    "trialId": "NCT02737501",
    "abstractText": "Brigatinib is a potent and selective next-generation ALK and ROS1 inhibitor. We compared the efficacy and safety of brigatinib with crizotinib as first-line therapy in patients with advanced ALK-positive NSCLC. Primary endpoint was independent review committee-assessed progression-free survival.",
    "methodsText": "Open-label, phase 3, randomized (1:1). Treatment-naive ALK-positive advanced NSCLC. Primary: IRC-assessed PFS.",
    "peerReviewed": "true",
    "confidence": "High",
    "limitations": "Open-label design",
    "funding": "Takeda",
    "conflictOfInterest": "true"
  }
]
